[
    {
        "id": "mempool",
        "category": "Explorers",
        "name": "Mempool",
        "version": "2.1.2",
        "tagline": "A mempool visualizer, explorer and fee estimator",
        "description": "Mempool is the official self-hosted version of the fully featured explorer, visualizer, fee estimator, and API service running on mempool.space, an open source project developed and operated for the benefit of the Bitcoin community, with a focus on the emerging transaction fee market to help our transition into a multi-layer ecosystem.\n\nFeatures:\n\n- Live dashboard visualizing the mempool and blockchain\n- Live transaction tracking\n- Search any transaction, block or address\n- Fee estimations\n- Mempool historical data\n- TV View for larger displays as a TV in a cafe or bar\n- View transaction scripts and op_return messages\n- Audio notifications on transaction confirmed and address balance change\n- Multiple languages support\n- JSON APIs",
        "developer": "mempool.space",
        "website": "https://mempool.space/about",
        "dependencies": [
            "bitcoind",
            "electrum"
        ],
        "repo": "https://github.com/mempool/mempool",
        "support": "https://t.me/mempoolspace",
        "port": 3006,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "",
        "defaultPassword": ""
    },
    {
        "id": "btc-rpc-explorer",
        "category": "Explorers",
        "name": "BTC RPC Explorer",
        "version": "2.2.0",
        "tagline": "Simple, database-free blockchain explorer",
        "description": "BTC RPC Explorer is a full-featured, self-hosted explorer for the Bitcoin blockchain. With this explorer, you can explore not just the blockchain database, but also explore the functional capabilities of your Umbrel.\n\nIt comes with a network summary dashboard, detailed view of blocks, transactions, addresses, along with analysis tools for viewing stats on miner activity, mempool summary, with fee, size, and age breakdowns. You can also search by transaction ID, block hash/height, and addresses.\n\nIt's time to appreciate the \"fullness\" of your node.",
        "developer": "Dan Janosik",
        "website": "https://explorer.btc21.org",
        "dependencies": [
            "bitcoind",
            "electrum"
        ],
        "repo": "https://github.com/janoside/btc-rpc-explorer",
        "support": "https://github.com/janoside/btc-rpc-explorer/discussions",
        "port": 3002,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "",
        "defaultPassword": ""
    },
    {
        "id": "samourai-server",
        "category": "Wallet Servers",
        "name": "Samourai Server",
        "version": "1.8.1",
        "tagline": "Your private backing server for Samourai Wallet",
        "description": "Samourai Server is an exclusive Umbrel app that runs Samourai Dojo and Whirlpool backing servers, and provides you easy step-by-step instructions to connect your Samourai Wallet to them. Samourai Wallet is unrivaled in transaction privacy, but its default configuration is still subject to network level privacy loss.\n\nBy default, Samourai Wallet will connect to its centrally controlled Dojo hosted in Iceland. By hosting your own Samourai Server, you can bypass its servers completely when using Samourai Wallet or Sentinel, and gain total financial sovereignty without any complexity.",
        "developer": "Samourai",
        "website": "https://samouraiwallet.com",
        "dependencies": [
            "bitcoind"
        ],
        "repo": "https://code.samourai.io/dojo/samourai-dojo",
        "support": "https://t.me/SamouraiWallet",
        "port": 3005,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "/connect/",
        "defaultPassword": ""
    },
    {
        "id": "specter-desktop",
        "category": "Wallets",
        "name": "Specter Desktop",
        "version": "1.1.0",
        "tagline": "Multisig with hardware wallets made easy",
        "description": "Specter Desktop connects to the Bitcoin Core running on your Umbrel and functions as a watch-only coordinator for multi-signature and single-key Bitcoin wallets. At the moment Specter Desktop is working with all major hardware wallets including:\n\n- Trezor\n- Ledger\n- KeepKey\n- BitBox02\n- ColdCard (optionally airgapped, using an SD card)\n- Electrum (optionally airgapped, if running Electrum on an airgapped computer/phone)\n- Specter DIY (optionally airgapped, using QR codes)\n- Cobo (airgapped, using QR codes)\n\nSpecter Desktop also supports using the Bitcoin Core on your Umbrel as a hot wallet, by importing or generating a random BIP39 mnemonic, but this feature is experimental and we do not recommend using it at this stage. We plan to add support for other hardware wallets as they come up.",
        "developer": "Crypto Advance",
        "website": "https://specter.solutions",
        "dependencies": [
            "bitcoind"
        ],
        "repo": "https://github.com/cryptoadvance/specter-desktop",
        "support": "https://t.me/spectersupport",
        "port": 25441,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "",
        "defaultPassword": ""
    },
    {
        "id": "sphinx-relay",
        "category": "Messaging",
        "name": "Sphinx Relay",
        "version": "1.3.8",
        "tagline": "Chat and pay over the Lightning Network",
        "description": "Sphinx Relay turns your Lightning node into a personal communication server. Messages are end-to-end encrypted and transmitted over the Bitcoin Lightning Network. Download Sphinx on your phone from https://sphinx.chat and pair it with Sphinx Relay on Umbrel.\n\nCommunication between Sphinx Relay nodes takes place entirely on the Lightning Network, so it is decentralized, untraceable, and encrypted. Messages are encrypted using client public keys on the Sphinx app.\n\nYou can join tribes at https://tribes.sphinx.chat. If you join a podcast tribe, you can listen to the podcast in Sphinx and stream donations to the host.",
        "developer": "Stakwork",
        "website": "https://sphinx.chat",
        "dependencies": [
            "lnd"
        ],
        "repo": "https://github.com/stakwork/sphinx-relay",
        "support": "https://t.me/joinchat/Fb4OcRo4LrRD6NXfsNdeeQ",
        "port": 3300,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "/connect",
        "defaultPassword": ""
    },
    {
        "id": "ride-the-lightning",
        "category": "Lightning Node Management",
        "name": "Ride The Lightning",
        "version": "0.10.0-beta",
        "tagline": "A powerful dashboard for the Lightning Network",
        "description": "RTL is a full function, device agnostic, web user interface to help manage lightning node operation. It enables full control over your lightning node with rich functionality for Bitcoin base layer and Lightning Network. Some cool features available on RTL are:\n\n- Rich dashboard with two layout options\n- Send/Receive funds on-chain\n- Rich channel management with advanced features like balance score, circular re-balancing etc.\n- Payments and Invoice management with QR codes\n- Routing analysis for the payments forwarded\n- Channel backups\n- Detailed reports on routing and transaction history\n- Optional Loop interface for submarine swaps\n- Customizable UI with multiple color schemes and dark/light modes",
        "developer": "Shahana and Suheb",
        "website": "https://github.com/Ride-The-Lightning/RTL",
        "dependencies": [
            "lnd"
        ],
        "repo": "https://github.com/Ride-The-Lightning/RTL",
        "support": "https://github.com/Ride-The-Lightning/RTL/issues/new",
        "port": 3001,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "",
        "defaultPassword": "moneyprintergobrrr"
    },
    {
        "id": "lightning-terminal",
        "category": "Lightning Node Management",
        "name": "Lightning Terminal",
        "version": "0.4.0-alpha",
        "tagline": "The easiest way to manage channel liquidity",
        "description": "Lightning Terminal is the easiest way to manage inbound and outbound liquidity on the Lightning Network. Keep your channels open and the funds flowing. It provides a visual interface for interacting with your channels and balances using Loop. \n\nNew: Introducing Lightning Pool, a marketplace for Lightning channels. You can now earn sats by opening new channels to those looking to receive funds on Lightning for a set period of time, or rent a channel to start accepting payments instantly. Join the marketplace and start putting your Bitcoin to work.\n\nWhy use Pool?\n- Earn a return on Lightning capital\n- Rent a channel and start accepting payments instantly\n- Open channels for less with transaction batching\n\nWhy use Loop?\n- Add \"inbound liquidity\" to receive payments\n- Reduce transaction fees by recycling and reusing Lightning channels\n- Send funds to and from users or services that aren't yet Lightning enabled\n- Configurable wait times and \"batching\" allow for further fee savings\n- Refill and offload funds from any number of Lightning channels in a single on-chain transaction",
        "developer": "Lightning Labs",
        "website": "https://lightning.engineering",
        "dependencies": [
            "lnd"
        ],
        "repo": "https://github.com/lightninglabs/lightning-terminal",
        "support": "https://github.com/lightninglabs/lightning-terminal/issues/new",
        "port": 3004,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg",
            "4.jpg"
        ],
        "path": "",
        "defaultPassword": "moneyprintergobrrr"
    },
    {
        "id": "thunderhub",
        "category": "Lightning Node Management",
        "name": "ThunderHub",
        "version": "0.12.7",
        "tagline": "Take full control of your Lightning node",
        "description": "ThunderHub allows you to take full control of your Lightning node with a slick and awesome UI. Explore all the options that ThunderHub has to offer, from sending and receiving Lightning payments, to checking your node's health statistics, and even more advanced options like channel rebalancing and multi-path lightning payments.\n\nManaging and monitoring your node has never been easier with transaction reports, graphs and a huge assortment of different features all bundled inside of this great tool.",
        "developer": "Anthony Potdevin",
        "website": "https://apotdevin.com",
        "dependencies": [
            "lnd"
        ],
        "repo": "https://github.com/apotdevin/thunderhub",
        "support": "https://t.me/thunderhub",
        "port": 3000,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "",
        "defaultPassword": "moneyprintergobrrr"
    },
    {
        "id": "lnbits",
        "category": "Lightning Node Management",
        "name": "LNbits",
        "version": "8188ae0",
        "tagline": "Multi-user wallet management system",
        "description": "LNbits is a simple multi-user and account system for Lightning Network that can be used for creating separate Lightning wallets for friends and family members. You can also create multiple accounts for yourself to mitigate the risk of exposing applications to your full balance via unique API keys for each wallet.\n\nLNbits is packaged with tools to help manage funds, such as a table of transactions, line chart of spending, export to CSV, and more to come. It provides an extendable platform for expanding Lightning Network functionality via LNbits extension framework, and can also be used as a fallback wallet for the LNURL scheme.",
        "developer": "LNbits",
        "website": "https://github.com/lnbits/lnbits",
        "dependencies": [
            "lnd"
        ],
        "repo": "https://github.com/lnbits/lnbits",
        "support": "https://t.me/lnbits",
        "port": 3007,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "",
        "defaultPassword": ""
    },
    {
        "id": "btcpay-server",
        "category": "Payments",
        "name": "BTCPay Server",
        "version": "1.0.6.8",
        "tagline": "Accept Bitcoin payments with 0 fees & no 3rd party",
        "description": "BTCPay Server is a payment processor that allows you to receive payments in Bitcoin (and altcoins) directly, with no fees, transaction cost or a middleman. It is a non-custodial invoicing system which eliminates the involvement of a third-party.\n\nPayments with BTCPay Server go directly to your wallet, which increases the privacy and security. Your private keys are never uploaded to your Umbrel. There is no address re-use, since each invoice generates a new address deriving from your xpubkey.\n\nYou can not only to attach an unlimited number of stores and use the Lightning Network but also become a payment processor for others. Thanks to the apps built on top of it, you can use BTCPay to receive donations, start a crowdfunding campaign or have an in-store Point of Sale.",
        "developer": "BTCPay Server Foundation",
        "website": "https://btcpayserver.org",
        "dependencies": [
            "bitcoind",
            "lnd"
        ],
        "repo": "https://github.com/btcpayserver/btcpayserver",
        "support": "https://chat.btcpayserver.org",
        "port": 3003,
        "gallery": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ],
        "path": "",
        "defaultPassword": ""
    }
]
